{
  "name": "SecureDrop ID - Delivery Authorization System",
  "description": "A Proof-of-Concept (PoC) system designed to enhance last-mile delivery security through double verification mechanisms. SecureDrop introduces a customer-first authorization model using QR codes, OTP, and (future) NFC-based validation, empowering customers to control package handovers while enabling brands to reduce fraud and unauthorized deliveries.",
  "type": "Public Project",
  "tags": [
    "System Design",
    "Security",
    "B2B SDK",
    "B2C App",
    "Authentication",
    "Logistics",
    "Proof of Concept"
  ],
  "status": "Ongoing - Proof of Concept",
  "technologies": [
    "React",
    "Next.js",
    "Node.js",
    "Express",
    "Firebase",
    "MongoDB",
    "QR Code Services",
    "OTP Authentication",
    "SDK Development"
  ],
  "features": [
    "Unique SecureDropID with QR tagging for each package",
    "Customer-controlled delivery approval via B2C app",
    "Double verification for delivery agents (QR + OTP/QR/NFC)",
    "B2B SDK for seamless integration with brand backends",
    "Delegated authorization via dynamic codes for family/friends",
    "Delivery audit trail with verification history"
  ],
  "deliverables": {
    "B2B_SDK": [
      "SecureDropID + QR tagging for every order",
      "Integration APIs for brand backend systems",
      "Verification hooks for real-time authorization checks",
      "Lightweight QR service for package tagging"
    ],
    "B2C_App": [
      "Delivery dashboard to track and manage upcoming orders",
      "Approve or reject deliveries in real-time",
      "Multi-factor verification: OTP, QR, and (future) NFC",
      "Delegated access with temporary codes for trusted contacts",
      "Comprehensive delivery history with verification logs"
    ]
  },
  "roadmap": [
    "Stage 1 (Current PoC): Build core flows — QR-based order tagging, OTP verification, customer approval via B2C app, and SDK prototype for brands.",
    "Stage 2: Extend B2B SDK with robust APIs for integration and real-time delivery authorization checks.",
    "Stage 3: Enhance B2C app with delivery history, delegated access (family/friends), and improved UI for real-time approvals.",
    "Stage 4: Introduce NFC-based virtual card verification to support touch-based double authorization.",
    "Stage 5: Add anomaly detection using AI/ML to flag unusual delivery patterns (e.g., location/time mismatches).",
    "Stage 6: Implement blockchain-backed audit logs to ensure tamper-proof delivery history.",
    "Stage 7 (Future): Release native mobile apps for customers and delivery agents with full SecureDrop flows."
  ],
  "eventImages": [
    {
      "title": "High-Level Architecture",
      "description": "System overview of SecureDrop showing B2B SDK, B2C App, and verification services.",
      "path": "architecture.png"
    }
  ],
  "github": "https://github.com/HARIPRASAD-2003/SecureDrop",
  "key_learnings": [
    "Designing secure multi-factor authorization workflows",
    "Building SDKs for B2B integrations with third-party platforms",
    "Architecting microservices for QR and OTP verification",
    "Balancing usability with strong security protocols",
    "Mapping real-world logistics challenges into digital workflows"
  ],
  "story": {
    "origin": "SecureDrop originated as an idea to combat package theft and delivery fraud by shifting control to the end-customer.",
    "journey": "The project began with system design diagrams and workflow modeling, evolving into a multi-component PoC with QR and OTP-based double verification.",
    "growth": "Iterations have focused on integrating brand-side SDKs and customer-facing apps to demonstrate seamless collaboration between logistics providers and end-users.",
    "current": "SecureDrop is in its Proof-of-Concept stage, demonstrating double verification flows while laying the foundation for NFC, AI-driven anomaly detection, and blockchain-backed audit trails in the future."
  }
}
